Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་མི་གཡོ་བ་སྐྱེ་བའི་ཡུལ་ནི་བློ་གནས་ཞེས་བྱའོ། །
en: “The thus-gone Acala will be born in a place called Abiding Mind.

source: རིགས་ནི་རྒྱལ་རིགས་སོ། །འོད་ནི་དཔག་ཚད་ཁྲི་བདུན་སྟོང་ངོ་། །
en: His family will be kṣatriya. His light will extend seventeen thousand leagues.

source: སྲས་ནི་ཡེ་ཤེས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Wisdom will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་མཐུ་རྩལ་ཅན་ཞེས་བྱའོ། །
en: Endowed with Jewel Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་སྒྲ་སྒྲོགས་ཞེས་བྱའོ། །
en: Lion Roarer will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་དྲུག་ཅུ་དྲུག་ཅུའོ། །
en: There will be twenty-three consecutive congregations, each of them gathering sixty billion.

source: དམ་པའི་ཆོས་ནི་ལོ་བདུན་ཁྲི་བདུན་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seventy-seven thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཕན་པ་དང་ལྡན་པར་གཤེགས་པ་སྐྱེ་བའི་ཡུལ་ནི་སེང་གེས་བལྟས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Upakāragati will be born in a place called Beheld by Lions.

source: ཡབ་ནི་གཟི་བརྗིད་ཡིད་འཐད་ཅེས་བྱའོ། །
en: Splendid Reasoning Mind will be his father.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་སྨྲ་ཞེས་བྱའོ། །
en: Truth Speaker will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕྲ་བ་སྤོང་ཞེས་བྱའོ། །
en: Relinquishment of the Subtle will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be sixty consecutive congregations, each of them gathering seven hundred million.

source: དམ་པའི་ཆོས་ནི་ལོ་དྲུག་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for sixty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་སྒྲོན་མའི་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་བདུད་རྩིའི་སྤོས་ཞེས་བྱའོ། །
en: “The thus-gone Puṇya­pradīpa­rāja will be born in a place called Nectar Fragrance.

source: ཡབ་ནི་བསོད་ནམས་ཀྱི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Merit will be his father.

source: ཡུམ་ནི་མེ་ཏོག་གི་ཏོག་ཅེས་བྱའོ། །
en: Flower Crest will be his mother.

source: སྲས་ནི་རིན་ཆེན་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Jewel will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་མཐའ་ཡས་བཀོད་ཅེས་བྱའོ། །
en: Infinite Jewel Array will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དབྱངས་བྱིན་ཞེས་བྱའོ། །
en: Melody Gift will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་མཐའ་ཡས་བཀོད་ཅེས་བྱའོ། །
en: Infinite Jewel Array will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་ཀྱིས་བསྐུལ་བ་སྐྱེ་བའི་ཡུལ་ནི་ཡིད་དུ་འོང་བའི་དབྱངས་ཞེས་བྱའོ། །
en: “The thus-gone Svaracodaka will be born in a place called Delightful Melody.

source: འོད་ནི་དཔག་ཚད་ཉིས་སྟོང་དྲུག་བརྒྱའོ། །
en: His light will extend two thousand six hundred leagues.

source: ཡབ་ནི་སྒྲོན་མའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Lamp King will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་ཆེན་མོ་ཞེས་བྱའོ། །
en: Great Splendor will be his mother.

source: སྲས་ནི་རིན་ཆེན་རྣམ་པར་གྲགས་ཞེས་བྱའོ། །
en: Famed Jewel will be his son.

source: རིམ་གྲོ་པ་ནི་འཁྲུལ་པ་མེད་པར་སེམས་པ་ཞེས་བྱའོ། །
en: Mind Free from Delusion will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མིག་སྡུག་ཅེས་བྱའོ། །
en: Delightful Eye will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Merit Lamp will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དགུའོ། །
en: There will be thirteen consecutive congregations, each of them gathering nine hundred ninety million.

source: དེ་བཞིན་གཤེགས་པ་གཽ་ཏ་མ་སྐྱེ་བའི་ཡུལ་ནི་དྲང་སྲོང་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Gautama will be born in a place called Splendid Sages.

source: འོད་ནི་དཔག་ཚད་ཁྲི་བཞི་སྟོང་ངོ་། །
en: His light will extend fourteen thousand leagues.

source: ཡབ་ནི་བསམ་གཏན་དགའ་ཞེས་བྱའོ། །
en: Meditation Joy will be his father.

source: ཡུམ་ནི་ཡིད་དུ་འོང་ཞེས་བྱའོ། །
en: Delightful will be his mother.

source: སྲས་ནི་ཙམ་པ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Campaka will be his son.

source: རིམ་གྲོ་པ་ནི་བདུད་རྩིའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Nectar Flower will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་སྟབས་ཞེས་བྱའོ། །
en: Powerful Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་འགྲུས་བརྟན་པོའི་གོ་བགོས་པ་ཞེས་བྱའོ། །
en: Donning the Armor of Firm Diligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་བརྒྱ་ཕྲག་བཅྭ་བརྒྱད་བཅྭ་བརྒྱད་དོ། །
en: There will be eighty consecutive congregations, each of them gathering eighteen billion.

source: དེ་བཞིན་གཤེགས་པ་མདངས་སྟོབས་སྐྱེ་བའི་ཡུལ་ནི་ཡིད་འོང་མཐོང་ཞེས་བྱའོ། །
en: “The thus-gone Ojobala will be born in a place called Delightful Sight.

source: འོད་ནི་དཔག་ཚད་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: His light will extend eighteen thousand leagues.

source: ཡུམ་ནི་ལྟ་བ་གསལ་ཞེས་བྱའོ། །
en: Luminous View will be his mother.

source: སྲས་ནི་སྙིང་སྟོབས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Courage will be his son.

source: རིམ་གྲོ་པ་ནི་བདེན་གྲོགས་ཞེས་བྱའོ། །
en: Truth Friend will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Power will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་དུ་འོང་བྱིན་ཞེས་བྱའོ། །
en: Delightful Gift will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་རེ་རེའོ། །
en: There will be eighty-two consecutive congregations, each of them gathering eight hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲི་སུམ་སྟོང་ངོ་། །
en: The extent of his lifespan will be eighty-three thousand years.

source: དེ་བཞིན་གཤེགས་པ་བློ་གནས་པའི་རང་བཞིན་སྐྱེ་བའི་ཡུལ་ནི་འོད་མཐོང་ཞེས་བྱའོ། །
en: “The thus-gone Sthita­buddhi­rūpa will be born in a place called Sight of Light.

source: འོད་ནི་དཔག་ཚད་དགུ་བཅུ་རྩ་གཅིག་གོ། །
en: His light will extend ninety-one leagues.

source: སྲས་ནི་བདེན་པའི་ཏོག་ཅེས་བྱའོ། །
en: Truth Crest will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོད་བཀོད་ཅེས་བྱའོ། །
en: Array of Offerings will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ཀྱི་སྤོང་བ་ཞེས་བྱའོ། །
en: Excertion in Wisdom will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་གོ། །
en: There will be fifty consecutive congregations, each of them gathering one million six hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་བཟང་པོ་སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་མངོན་པར་དགའ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Sucandra will be born in a place called Joyous World.

source: ཡབ་ནི་ཟླ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Moon will be his father.

source: ཡུམ་ནི་སྣང་བ་བྱིན་ཞེས་བྱའོ། །
en: Light Gift will be his mother.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་རིན་ཆེན་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Precious Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཁ་ལོ་སྒྱུར་ཞེས་བྱའོ། །
en: Leader Qualities will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བདུན་ཅུ་རྩ་བདུན་བདུན་ནོ། །
en: There will be seventy-six consecutive congregations, each of them gathering seven million seven hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཡན་ལག་མེ་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་བདུད་རྩིའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: “The thus-gone Bodhyaṅgapuṣpa will be born in a place called Nectar Flower.

source: འོད་ནི་དཔག་ཚད་དགུ་ཁྲིའོ། །
en: His light will extend ninety thousand leagues.

source: ཡབ་ནི་ཡེ་ཤེས་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Wisdom will be his father.

source: ཡུམ་ནི་ཆོས་ཀྱི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Dharma Flower will be his mother.

source: སྲས་ནི་སྟོན་པ་གྲགས་ཞེས་བྱའོ། །
en: Renowned Teacher will be his son.

source: རིམ་གྲོ་པ་ནི་ཐར་པ་པད་མ་དཀར་པོ་ཞེས་བྱའོ། །
en: White Lotus of Liberation will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Renown will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Insight will be foremost in terms of miraculous abilities.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་ཁྲི་བཞི་སྟོང་ངོ་། །
en: The extent of his lifespan will be sixty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་བཀྲ་ཤིས་སྐྱེ་བའི་ཡུལ་ནི་མཐོ་བ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Siddhi will be born in a place called Nothing Higher.

source: ཡུམ་ནི་དལ་གྱིས་འགྲོ་ཞེས་བྱའོ། །
en: Leisurely Movement will be his mother.

source: སྲས་ནི་སེང་གེའི་སྒྲ་ཞེས་བྱའོ། །
en: Lion’s Roar will be his son.

source: རིམ་གྲོ་པ་ནི་དྲག་ཤུལ་སྡེ་ཞེས་བྱའོ། །
en: Fierce Army will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ནོར་ལྷ་ཞེས་བྱའོ། །
en: Wealth God will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྟོན་པ་སེམས་ཞེས་བྱའོ། །
en: Teacher Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་དགུ་བཅུ་དགུ་བཅུའོ། །
en: There will be sixteen consecutive congregations, each of them gathering ninety billion.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་སྟོན་སྐྱེ་བའི་ཡུལ་ནི་སྟོན་པའི་མཆོད་ཅེས་བྱའོ། །
en: “The thus-gone Praśasta will be born in a place called Teacher Worship.

source: འོད་ནི་དཔག་ཚད་འབུམ་ཕྲག་བརྒྱད་དོ། །
en: His light will extend eight hundred thousand leagues.

source: ཡུམ་ནི་བློ་གྲོས་རྒྱ་ཆེན་ཞེས་བྱའོ། །
en: Vast Intelligence will be his mother.

source: སྲས་ནི་མཆོད་བྱིན་ཞེས་བྱའོ། །
en: Sacrifice will be his son.

source: རིམ་གྲོ་པ་ནི་དགའ་བའི་གཟི་བརྗིད་གྲགས་ཞེས་བྱའོ། །
en: Famed Splendor of Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་གཟི་བརྗིད་གྲགས་ཞེས་བྱའོ། །
en: Famed Splendid Jewel will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་བློ་གྲོས་གྲགས་ཞེས་བྱའོ། །
en: Famed Lion Intelligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་རྩ་བདུན་ཏེ། །ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་བཞི་བཞིའོ། །
en: There will be seventy-seven consecutive congregations, each of them gathering three hundred forty million.

source: དམ་པའི་ཆོས་ནི་ལོ་ཉི་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གཟི་བརྗིད་སྟོབས་སྐྱེ་བའི་ཡུལ་ནི་གཞན་གྱིས་མི་ཐུབ་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Balatejojñāna will be born in a place called Indomitable Splendor.

source: ཡབ་ནི་མྱ་ངན་བྱིན་ཞེས་བྱའོ། །
en: Pain Gift will be his father.

source: ཡུམ་ནི་འཇིག་རྟེན་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of the World will be his mother.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་ཉི་མ་ཞེས་བྱའོ། །
en: Sun of Insight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་མཆོག་མཆོད་ཅེས་བྱའོ། །
en: Worship of Supreme Gods will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་ཉི་ཤུ་རྩ་ལྔ་ལྔའོ། །
en: There will be thirty consecutive congregations, each of them gathering two million five hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་དགེ་བའི་སྒྲོན་མ་སྐྱེ་བའི་ཡུལ་ནི་བདུད་རྩིའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The thus-gone Kuśalapradīpa will be born in a place called Nectar Splendor.

source: ཡབ་ནི་གྲགས་པའི་མཐའ་ཡས་འགྲོ་ཞེས་བྱའོ། །
en: Movement of Infinite Fame will be his father.

source: ཡུམ་ནི་དགྲ་བཅོམ་མེ་ཏོག་རིན་ཆེན་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Worthy Flower of Precious Splendor will be his mother.

source: སྲས་ནི་ལྷས་མཆོད་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of Divine Worship will be his son.

source: རིམ་གྲོ་པ་ནི་གྲོལ་བའི་ཕུང་པོ་ཞེས་བྱའོ། །
en: Aggregate of Liberation will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་པའི་བློ་གྲོས་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Intelligence of the Truth will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་ལྔ་ལྔའོ། །
en: There will be ninety-two consecutive congregations, each of them gathering three hundred fifty million.

source: དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་བརྟན་པོ་སྐྱེ་བའི་ཡུལ་ནི་ཐུབ་དཀའ་ཞེས་བྱའོ། །
en: “The thus-gone Dṛḍhavikrama will be born in a place called Hard to Dominate.

source: ཡབ་ནི་ཟླ་ལུས་ཞེས་བྱའོ། །
en: Moon Body will be his father.

source: ཡུམ་ནི་ཐར་པ་དམིགས་ཞེས་བྱའོ། །
en: Focus on Liberation will be his mother.

source: སྲས་ནི་གྲགས་ཆེན་ཞེས་བྱའོ། །
en: Great Fame will be his son.

source: རིམ་གྲོ་པ་ནི་དགའ་དབྱངས་འདམ་བུ་ཞེས་བྱའོ། །
en: Reeds of the Melody of Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་གནས་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Enduring Fame will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ང་རོ་འཇམ་པའི་དབྱངས་ཞེས་བྱའོ། །
en: Call of Gentle Melody will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be fourteen consecutive congregations, each of them gathering one million.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་སྒྲ་སྐྱེ་བའི་ཡུལ་ནི་ཡིད་དུ་འོང་བས་བྱིན་ཞེས་བྱའོ། །
en: “The thus-gone Devaruta will be born in a place called Gift of Beauty.

source: ཡུམ་ནི་བཀོད་པ་ལེགས་མཐོང་ཞེས་བྱའོ། །
en: Excellent Perception of the Array will be his mother.

source: སྲས་ནི་མེ་ཏོག་གི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Flower Intelligence will be his son.

source: རིམ་གྲོ་པ་ནི་གཟི་བརྗིད་མདངས་ཞེས་བྱའོ། །
en: Splendid Brightness will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་དགའ་བའི་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Universal Joy will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ། །
en: Moon Absorption will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be ninety consecutive congregations, each of them gathering ten billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་ཁྲི་བཞི་སྟོང་ངོ་། །
en: The extent of his lifespan will be thirty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཞི་བ་སྐྱེ་བའི་ཡུལ་ནི་ཀུན་ཏུ་སྒྲ་ཞེས་བྱའོ། །
en: “The thus-gone Praśānta will be born in a place called Universal Sound.

source: འོད་ནི་དཔག་ཚད་དགུ་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: His light will extend ninety-eight thousand leagues.

source: ཡབ་ནི་བདེན་སྨྲ་ཞེས་བྱའོ། །
en: Truth Speaker will be his father.

source: ཡུམ་ནི་མེ་ཏོག་མ་ཞེས་བྱའོ། །
en: Flower Lady will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་རིན་ཆེན་བདུན་ཞེས་བྱའོ། །
en: Seven Splendid Jewels will be his son.

source: རིམ་གྲོ་པ་ནི་བདུད་རྩི་ཤིས་པ་ཞེས་བྱའོ། །
en: Auspicious Nectar will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་མཐོང་བ་ཞེས་བྱའོ། །
en: Universal Perception will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་འགྲོ་བའི་སྟོབས་ཞེས་བྱའོ། །
en: Ever-Present Strength will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be eighty-eight consecutive congregations, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མའི་ཞལ་སྐྱེ་བའི་ཡུལ་ནི་བཀོད་པ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Sūryānana will be born in a place called Infinite Array.

source: འོད་ནི་དཔག་ཚད་སུམ་ཁྲི་སུམ་སྟོང་ངོ་། །
en: His light will extend thirty-three thousand leagues.

source: ཡབ་ནི་སྐྱོབ་པ་ཞེས་བྱའོ། །
en: Protector will be his father.

source: ཡུམ་ནི་ཁ་ལོ་སྒྱུར་བའི་ཏོག་ཅེས་བྱའོ། །
en: Leader Crest will be his mother.

source: སྲས་ནི་དབྱངས་སྙན་ཞེས་བྱའོ། །
en: Delightful Melody will be his son.

source: རིམ་གྲོ་པ་ནི་བརྟུལ་ཞུགས་མི་ཚུགས་པ་ཞེས་བྱའོ། །
en: Unassailable Yogic Discipline will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་ལེགས་གནས་ཞེས་བྱའོ། །
en: Excellent Abiding Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་ཀུན་ལས་ཤིན་ཏུ་འཕགས་པ་ཞེས་བྱའོ། །
en: Vastly Superior to the World will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be eighty consecutive congregations, each of them gathering two hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་ཐར་པའི་བརྟུལ་ཞུགས་སྐྱེ་བའི་ཡུལ་ནི་སྙན་པར་གྲགས་པའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: “The thus-gone Mokṣavrata will be born in a place called Banner of Fame.

source: ཡབ་ནི་ཡིད་འོང་གྲགས་ཞེས་བྱའོ། །
en: Delightful Fame will be his father.

source: ཡུམ་ནི་ཡིད་འཐད་མཚན་མཐོང་ཞེས་བྱའོ། །
en: Perception of Attested Signs will be his mother.

source: སྲས་ནི་མཐོང་ཆེན་གྲགས་ཞེས་བྱའོ། །
en: Famed Great Sight will be his son.

source: རིམ་གྲོ་པ་ནི་གཟི་བརྗིད་བློ་གྲོས་བདེ་ཞེས་བྱའོ། །
en: Blissful Splendid Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེམས་པ་རོ་གཅིག་པ་ཞེས་བྱའོ། །
en: Single-Flavored Attention will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་ཀྱི་དཔུང་རབ་ཏུ་འཇོམས་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor That Vanquishes the Māra Hordes will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be ninety-six consecutive congregations, each of them gathering nine hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་ཚུལ་ཁྲིམས་འོད་སྐྱེ་བའི་ཡུལ་ནི་ཁ་ན་མ་ཐོ་བ་མེད་ཅེས་བྱའོ། །
en: “The thus-gone Śīlaprabha will be born in a place called Free from the Unspeakable.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: His light will extend eighty-five thousand leagues.

source: ཡབ་ནི་སེང་གེའི་བརྟུལ་ཞུགས་བློ་ཞེས་བྱའོ། །
en: Mind of Lion-Like Yogic Discipline will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་མཐའ་ཡས་མཆོད་ཅེས་བྱའོ། །
en: Worship of Infinite Splendor will be his mother.

source: སྲས་ནི་མཆོད་གྲགས་ཏོག་ཅེས་བྱའོ། །
en: Crest of Famed Worship will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་ཀུན་ཏུ་སྤྱོད་ཅེས་བྱའོ། །
en: Universal Partaking of Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་སྣང་བ་མཆོད་ཅེས་བྱའོ། །
en: Worship of Splendid Light will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷའི་མཐུ་རྩལ་སྟོབས་ཞེས་བྱའོ། །
en: Strength of Divine Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be ninety consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་གནས་སྐྱེ་བའི་ཡུལ་ནི་དགྲ་བཅོམ་སྤོང་ཞེས་བྱའོ། །
en: “The thus-gone Vratasthita will be born in a place called Worthy Relinquishment.

source: འོད་ནི་དཔག་ཚད་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །
en: His light will extend eight hundred million leagues.

source: ཡབ་ནི་ཀུན་ཏུ་གཟི་བརྗིད་དཔལ་ཞེས་བྱའོ། །
en: Glory of Universal Splendor will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་གསལ་མཆོད་མ་ཞེས་བྱའོ། །
en: Worship of Luminous Qualities will be his mother.

source: སྲས་ནི་ལྷ་མཆོག་མེ་ཏོག་མཆོད་གྲགས་ཞེས་བྱའོ། །
en: Famed Flower Worship of Supreme Divinity will be his son.

source: རིམ་གྲོ་པ་ནི་ཁ་ལོ་སྒྱུར་བར་གྲགས་ཞེས་བྱའོ། །
en: Famed Leader will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགྲོས་བརྟན་དགེ་བ་ཡངས་ཞེས་བྱའོ། །
en: Expanding Virtue Through Steady Progress will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མིའི་མཆོད་རྟེན་ཞེས་བྱའོ། །
en: Stūpa for Humanity will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be ninety-one consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་རྡུལ་མེད་སྐྱེ་བའི་ཡུལ་ནི་སྐྱོན་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Arajas will be born in a place called Flawless.

source: འོད་ནི་དཔག་ཚད་སུམ་ཁྲི་ལྔ་སྟོང་ངོ་། །
en: His light will extend thirty-five thousand leagues.

source: ཡབ་ནི་རིན་ཆེན་ཟླ་བ་ཞེས་བྱའོ། །
en: Precious Moon will be his father.

source: ཡུམ་ནི་ཏོག་བཟངས་ཞེས་བྱའོ། །
en: Excellent Crest will be his mother.

source: སྲས་ནི་ཀུན་ནས་རིན་ཆེན་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Universal Preciousness will be his son.

source: རིམ་གྲོ་པ་ནི་ཆེན་པོ་བྱིན་ཞེས་བྱའོ། །
en: Gift of Greatness will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟི་བརྗིད་མཐའ་ཡས་ཕུང་པོའི་འོད་ཅེས་བྱའོ། །
en: Mass of Light of Infinite Splendor will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་སྟོབས་གྲུབ་མཆོད་སྦྱིན་ཞེས་བྱའོ། །
en: Sacrifice of the Strong Accomplishment of Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་རེ་རེའོ། །
en: There will be eighty-six consecutive congregations, each of them gathering ten thousand.

source: དེ་བཞིན་གཤེགས་པ་སྙིང་པོ་འཕགས་སྐྱེ་བའི་ཡུལ་ནི་མཛེས་པ་མི་གཡོ་བ་ཞེས་བྱའོ། །
en: “The thus-gone Sārodgata will be born in a place called Immutable Beauty.

source: ཡབ་ནི་བདུད་རྩིའི་བཀོད་པ་ཞེས་བྱའོ། །
en: Nectar Array will be his father.

source: ཡུམ་ནི་བློ་གྲོས་གྲགས་མ་ཞེས་བྱའོ། །
en: Famed Intelligence will be his mother.

source: སྲས་ནི་ཆོས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Dharma Banner will be his son.

source: རིམ་གྲོ་པ་ནི་ཡུལ་འཁོར་སྙོམས་ཞེས་བྱའོ། །
en: Even Land will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ངན་སོང་སྤོང་ཞེས་བྱའོ། །
en: Relinquishment of the Lower Realms will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཀུན་ཏུ་གསལ་བ་ཏོག་ཅེས་བྱའོ། །
en: Crest of Universal Light will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be eighty consecutive congregations, each of them gathering eight million.

source: དེ་བཞིན་གཤེགས་པ་མིག་སྨན་སྐྱེ་བའི་ཡུལ་ནི་སྤོས་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Añjana will be born in a place called Supreme Incense.

source: འོད་ནི་དཔག་ཚད་མཐའ་ཡས་སོ། །
en: His light will cover infinite leagues.

source: ཡབ་ནི་ཡོན་ཏན་ཐམས་ཅད་གྲགས་ཞེས་བྱའོ། །
en: Fame of All Qualities will be his father.

source: ཡུམ་ནི་ཡིད་འོང་བྱིན་ཅེས་བྱའོ། །
en: Gift of Delight will be his mother.

source: སྲས་ནི་བདེན་པའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Truth will be his son.

source: རིམ་གྲོ་པ་ནི་བསོད་ནམས་བློ་གྲོས་ཞེས་བྱའོ། །
en: Meritorious Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཚན་གྱི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of the Marks will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཀོད་པ་མི་གཡོ་བ་ཞེས་བྱའོ། །
en: Immutable Array will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅྭ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be eighteen consecutive congregations, each of them gathering thirty-two billion.

source: དེ་བཞིན་གཤེགས་པ་འཕེལ་བར་མཛད་པ་སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Vardhana will be born in a place called Supreme Circle.

source: ཡུམ་ནི་གཟི་བརྗིད་མཐའ་ཡས་མཐོང་ཞེས་བྱའོ། །
en: Sight of Infinite Splendor will be his mother.

source: རིམ་གྲོ་པ་ནི་ཀུན་ཏུ་སྦེད་ཅེས་བྱའོ། །
en: Thoroughly Hidden will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་མཐའ་ཡས་གྲགས་ཞེས་བྱའོ། །
en: Fame of Infinite Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཉམ་པ་དང་མི་མཉམ་པའི་བློ་ཞེས་བྱའོ། །
en: Incomparable Mind will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be ninety-two consecutive congregations, each of them gathering eight million.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་འོད་སྐྱེ་བའི་ཡུལ་ནི་བདུད་རྩིའི་སྤོས་ཞེས་བྱའོ། །
en: “The thus-gone Gandhābha will be born in a place called Nectar Fragrance.

source: འོད་ནི་དཔག་ཚད་ལྔ་སྟོང་དྲུག་བརྒྱའོ། །
en: His light will extend five thousand six hundred leagues.

source: ཡབ་ནི་བདུད་ཟིལ་གྱིས་གནོན་པ་ཞེས་བྱའོ། །
en: Subjugator of the Māras will be his father.

source: ཡུམ་ནི་ཡུལ་འཁོར་ལྷ་ཆེན་ཞེས་བྱའོ། །
en: Great Divinity of the Land will be his mother.
